def area(a, b):
    '''
    Возвращает площадь прямоугольника с сторонами a и b
    Параметры:
        a (число): первая сторона прямоугольника
        b (число): вторая сторона прямоугольника (перпендикулярная первой)
    Возвращаемое значение:
        rectangle_area (число): площадь прямоугольника
    '''
    
    return a * b

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника с сторонами a и b
    Параметры:
        a (число): первая сторона прямоугольника
        b (число): вторая сторона прямоугольника (перпендикулярная первой)
    Возвращаемое значение:
        rectangle_perimeter (число): периметр прямоугольника
    '''
    
    return 2*a + 2*b
