def area(a, h):
    '''
    Возвращает площадь треугольника с основанием a и высотой h
    Параметры:
        a (число): основание треугольника
        h (число): высота треугольника
    Возвращаемое значение:
        triangle_area (число): площадь треугольника
    '''
    
    return a * h / 2

def perimeter(a, b, c):
    '''
    Возвращает периметр треугольника со сторонами a, b, c
    Параметры:
        a (число): первая сторона треугольника
        b (число): вторая сторона треугольника
        c (число): третья сторона треугольника
    Возвращаемое значение:
        triangle_perimeter (число): периметр треугольника
    '''
    
    return a + b + c
